[
    {
        "id": 1,
        "title": "The Dark Knight",
        "artist": "Christopher Nolan",
        "type": "movie",
        "rating": 10,
        "reviewDate": "2024-07-27",
        "image": "/images/darkknight.png",
        "review": "A top-tier action film in my book, this movie showcases Heath Ledger and Christian Bale at their best, delivering invigorating and complex performances. Centered around Bruce Wayne's internal struggle and his mission to save Gotham, Christopher Nolan crafts a cinematic masterpiece. The film is elevated by the Joker’s chilling presence, stunning cinematography, a powerful score, and an exceptional cast. This is undoubtedly one of my highest-rated films—a must-watch that exemplifies what much of the action genre is missing today."
    },
    {
        "id": 2,
        "title": "The Bear",
        "artist": "FX",
        "type": "show",
        "rating": 9.3,
        "reviewDate": "2024-07-27",
        "image": "/images/thebear.png",
        "review": "Off of a friend's recommendation, I was hesitant towards this show at first. But after 28 episodes in 2 days, I can safely say I was and still am hooked. The Bear displays the divergence between passion and its equal and opposite force: the fear of failure. The journey of Carmy, through constant failure and disaster, presents the human experience in its fullest form. What quickly became a top show for me, I'm excited for the future seasons and journey of Carmy, Sydney, and Richie."
    },
    {
        "id": 3,
        "title": "House of Cards",
        "artist": "Netflix",
        "type": "show",
        "rating": 8.8,
        "reviewDate": "2024-07-30",
        "image": "/images/houseofcards.png",
        "review": "First, this ranking will not include Season 6, for I think that's a completely separate show in my opinion. Kevin Spacey portrays the character of Frank Underwood to a T, a power-hungry sociopath who really never stops at nothing on his conquest to the top. Although I believe the show loses its suspense past the second season, I still find the acting, writing, and emotion to be top tier. I don't believe there will be a better political drama ever, but I still hope for one."
    },
    {
        "id": 4,
        "title": "Oppenheimer",
        "artist": "Christopher Nolan",
        "type": "movie",
        "rating": 9.1,
        "reviewDate": "2024-08-08",
        "image": "/images/oppenheimer.png",
        "review": "I was able to experience this movie in a 70mm theater for the first time, to which I can say I was blown away. The cinematography and score were my biggest takeaways from this movie, as I found it to be much more impressive in those matters. The acting, plot, and storytelling were all fantastic, but I did feel like it lacked the depth that other Nolan films had, especially in the last third of the movie. However, I still thoroughly enjoyed it, especially going through the mind of Oppenheimer himself and the catastrophic effects the Manhattan Project had on him."
    },
    {
        "id": 5,
        "title": "Psych",
        "artist": "USA Network",
        "type": "show",
        "rating": 8.3,
        "reviewDate": "2024-08-08",
        "image": "/images/psych.png",
        "review": "Psych was pretty much my introduction to real television, and I still keep it as one of my favorite TV shows. The light-hearted, comedic duo of Shawn Spencer and Burton Guster are a classic, and the show's ability to pair such with crime-solving plots makes it a fantastic watch. I especially enjoyed the yin-yang episodes, for I felt those were the most serious moments in the show where we really see the abilities of Shawn Spencer at a 100%. My favorite part of the show had to be Gus's nicknames, my favorite being Sh'Dynasy (comma to the top that's God's comma)."
    },
    {
        "id": 6,
        "title": "La La Land",
        "artist": "Damien Chazelle",
        "type": "movie",
        "rating": 8.7,
        "reviewDate": "2024-08-09",
        "image": "/images/lala.png",
        "review": "I was never a fan of musicals, but La La Land changed that for me. What was a simple, romance story turned into an emotional rollercoaster off of the stunning chemistry between Ryan Gosling and Emma Stone. I believe the film's score and cinematography, especially the usage of color, were some of the film's strongest suits and were what really made this film stand out from the rest in 2016. Damien Chazelle was able to one-up himself from 'Whiplash,' as this film set a new standard for musicals."
    },
    {
        "id": 7,
        "title": "Mad Max: Fury Road",
        "artist": "George Miller",
        "type": "movie",
        "rating": 9.1,
        "reviewDate": "2024-09-11",
        "image": "/images/madmax.png",
        "review": "Mad Max seems like a typical action movie with little to no plot. And I won't lie, the plot is pretty barren. The reason anyone watches this movie is simply the outstanding stunts and action sequences. George Miller is a pretty crazy guy to not have any CGI in this film, especially after seeing certain sequences. So while the movie lacks a lot of the things that I typically look for in a great film, it makes up for it with the incredible, jaw dropping action sequences that'll never be replicated."
    },
    {
        "id": 8,
        "title": "How I Met Your Mother",
        "artist": "Bays & Thomas Productions",
        "type": "show",
        "rating": 9.8,
        "reviewDate": "2024-09-11",
        "image": "/images/himym.png",
        "review": "I've just finished my first watch of this show, and it will forever be my comfort show. The show consistently has comedy in every sequence, but something I loved about it was how many lessons I could take away from the show to my own life. I felt that it was incredibly thought provoking, but at the same time, could make me laugh for days. Although I will forever oppose the ending, Ted, Barney, Robin, Lily, and Marshall are the greatest group of friends I've ever seen."
    },
    {
        "id": 9,
        "title": "Dune: Part Two",
        "artist": "Denis Villeneuve",
        "type": "movie",
        "rating": 9.6, 
        "reviewDate": "2024-09-24",
        "image": "/images/dune2.png",
        "review": "I'm essentially combining my review of Part One with this, as Part One serves more as a stepping stone and lacks much of the plot, which is more than made up for in this extraordinary film. I was able to watch it in IMAX, and I was quite amazed—there's no other way to explain it. The acting was powerful, to the point where I slowly felt like I was becoming a believer in the prophecy. Chalamet’s performance is hands down some of the best I have seen recently, fully embracing the role of a messiah and playing it to perfection. In IMAX, I was truly able to grasp the cinematography and score that had been praised so highly. Zimmer once again does an excellent job of tying the soundtrack seamlessly with Villeneuve’s vision. I am extremely excited to see what Part 3 has in store and curious to see if the Dune trilogy will become the greatest trilogy of all time."
    },
    {
        "id": 10,
        "title": "The Social Network",
        "artist": "David Fincher",
        "type": "movie",
        "rating": 9.9,
        "reviewDate": "2024-11-08",
        "image": "/images/socialnetwork.png",
        "review": "When I was shown this film, I was skeptical at first. I mean, how good can a biopic about a student creating a social media platform be? And from there, I was clearly mistaken. First, the pacing was incredible. Fast in the right areas, slow when needed, it fit the metric of what Facebook was all about at the time. The soundtrack complements perfectly and ties the film together, from the beginning scene walking through Harvard Yard, the crew race in Holland, to the pulsating track playing through the creation of FaceMash. And lastly, the actors. The dichomity of Eisenberg and Garfield, best friends to worst enemies, was portrayed perfectly. While one was rooted in loyatly, the other was rooted in ruthlessness. Together, they created one of the most memorable films of the decade, perfectly encapsualting the true story of Facebook's creation and the lives destroyed in the process, showcased through their climax scene near the end where fame drew a wedge in their friendship."
    },
    {
        "id": 11,
        "title":"Zodiac",
        "artist":"David Fincher",
        "type":"movie",
        "rating":9.2,
        "reviewDate":"2024-11-09",
        "image":"/images/zodiac.png",
        "review": ""
    },
    {
        "id": 12,
        "title":"Nightcrawler",
        "artist":"Dan Gilroy",
        "type":"movie",
        "rating":8.8,
        "reviewDate":"2024-11-09",
        "image":"/images/nightcrawler.png",
        "review": ""
    }
]     